"OK" = "OK";
"DONE" = "Tehty";
"Done" = "Tehty";
"CANCEL" = "Peruuttaa";

"Later" = "Myöhemmin";

"NEW_ACTION" = "Uusi toimi";
"DELETE_ACTION" = "Poista toiminta";
"Delete project" = "Poistaa hanke";
"Move to In-Basket" = "Siirrä postilaatikkoon";
"UNDO_ACTION" = "Kumoa loppuun";

"Date" = "Päivämäärä";
"Time" = "Aika";
"Alert" = "Hälytys";
"At the same time" = "Samaan aikaan";
"%@ before" = "%@ ennen kuin";

"LAST_MONTH" = "viime kuussa";
"LAST_WEEK" = "viime viikolla";
"LAST_YEAR" = "viime vuonna";
"NEXT_MONTH" = "ensi kuussa";
"NEXT_WEEK" = "ensi viikolla";
"NEXT_YEAR" = "ensi vuonna";
"SOMEDAY_MAYBE" = "joskus / ehkä";
"THIS_MONTH" = "tässä kuussa";
"THIS_WEEK" = "tällä viikolla";
"THIS_YEAR" = "tänä vuonna";
"TODAY" = "tänään";
"TOMORROW" = "huomenna";
"YESTERDAY" = "eilen";

"CALENDAR" = "Kalenteri";

"DESCRIPTION" = "Kuvaus";
"DISABLED" = "Pois käytöstä";
"ENABLED" = "Käytössä";
"SOUND" = "Ääni";
"TRY" = "Yrittää";
"Restore" = "Palauttaa";

"in-basket" = "saapuneet";
"delegated" = "delegoitu";
"completed" = "valmistunut";

"How soon do you plan to do this?" = "Kuinka pian aiot tehdä tämän?";
"Enable repeat and notification will be coming every minute until you act on it." = "Ota toista ja ilmoitus saapuu joka minuutti, kunnes teet sitä.";

/* \n is the line break */
"Pull down and release\nto add a new task." = "Vedä alas ja vapauta\nLisää uusi tehtävä";
"Pull a task to the right to\n• complete,\n• defer,\n• calendar or,\n• delegate it." = "Vedä tehtävä oikeutta\n• täydellinen,\n• lykätä,\n• kalenterin tai\n• siirtää se";
"Pull a task to the left to\n• remove,\n• repeat,\n• itemize or,\n• send it." = "Vedä tehtävää vasemmalle\n• poistaa,\n• toista,\n• eritellä tai,\n• lähetä se";
"Pull up and release\nto clear completed tasks." = "Vedä ja vapauta\npoista valmiit tehtävät";

"all done" = "kaikki on valmista";

"STATISTICS_ACTIONS_IN_LIST" = "toimet\novat luettelossa ";
"STATISTICS_ACTIONS_FOR_TODAY" = "toimia\ntehdä tänään";
"STATISTICS_ACTIONS_DONE_TOTAL" = "toimet\ntoteutetut";
"STATISTICS_DAYS_PASSED_TOTAL" = "päivät\nkuluivat";
"STATISTICS_ACTIONS_DONE_PER_DAY" = "toimien\npäivässä";

"Purchase" = "Ostaa";
"Receipt for this app expired." = "Kuitti tämän app vanhentunut.";
"Premium Feature" = "Tämä on palkkio-ominaisuus";
"Disable ads here just for %@ right now!" = "Hanki se juuri nyt %@!";
"Try for a week" = "Kokeile viikossa";
"This is a premium feature. But you disabled in-app purchases. Enable them in settings to proceed." = "Tämä on palkkio-ominaisuus. Mutta käytöstä in-app ostaa. Ota ne asetuksissa edetä.";
"Purchase transaction for the feature failed. Try again later." = "Ostotapahtuman ominaisuus epäonnistui. Yritä myöhemmin uudelleen.";
"This is a premium feature. But your device does not have internet connection now. Try again later." = "Tämä on palkkio-ominaisuus. Mutta laite ei ole internet-yhteyden. Yritä myöhemmin uudelleen.";
"All previously purchased features were restored." = "Kaikki aiemmin ostetut ominaisuudet palautettiin.";

"You can greatly help by writing a review." = "Voit suuresti auttaa kirjoittaa uudelleen.";

"WELCOME" = "Tervetuloa";
"keep tasks here" = "Säilytä tehtävät tässä";

"Repeat" = "Toistaa";
"DAY" = "PÄIVÄ";
"WEEK" = "VIIKKO";
"MONTH" = "KUUKAUSI";
"everyday" = "jokapäiväinen";
"done %@ times" = "tehty %@ kertaa";
"Skip repetition" = "Ohita toistoa";
"REPEAT_DAY_1" = "päivä";
"REPEAT_DAY_234" = "päivää";
"REPEAT_DAY_567890" = "päivää";

"Complete" = "Täydentää";
"Postpone" = "Lykätä";
"Schedule" = "Ajoittaa";

"Version" = "Versio";
"Feedback" = "Palaute";
"Help" = "Auttaa";
"Sounds" = "Äänet";
"Theme" = "Teema";
"Dark" = "Tumma";
"Light" = "Valo";
"Automatic" = "Automaattinen";
"Multiline titles" = "Multiline otsikot";
"Delete confirmation" = "Poista vahvistus";
"Icon badge" = "Ikoni rintanappi";
"Calendar reminder" = "Kalenteri muistutus";
"Overdue reminder" = "Myöhästymis muistutus";
"Process reminder" = "Prosessi muistutus";
"Review reminder" = "Review muistutus";
"Restore in-app purchases" = "Palauta in-app ostot";
"Send usage statistics" = "Lähetä käyttötilastoja";

"Application" = "App";
"Projects" = "Hankkeiden";
"Periodic tasks" = "Kausittaiset tehtävät";
"Archive" = "Arkisto";

"Change in storage" = "Muuttaa varastossa";
"Сopy existing tasks to the new storage?" = "Kopioida aiemmin luodut tehtävät uusi tallennustilaa?";

"You don't have tasks for today.\n•\nGo back by pinching in or shaking." = "Sinulla ei ole tehtäviä tänään.\n•\nMene takaisin nipistämällä tai ravistamalla.";
"You don't have tasks in this project.\n•\nAdd tasks by pulling down.\n•\nGo back by pinching in or shaking." = "Sinulla ei ole tehtäviä tässä hankkeessa.\n•\nLisää tehtäviä vetämällä alaspäin.\n•\nMene takaisin nipistämällä tai ravistamalla.";

/* %@ is where number of done actions will go */
"You have uncompleted tasks (%@). Complete them or assign them new dates." = "Sinulla on keskeneräiset tehtävät. Ne tai asettaa niille uudet päivämäärät. (%@)";
"You should process collected tasks (%@) regularly to stay organized." = "Käsitellä kerätään tehtäviä säännöllisesti jotta harus järjestellä. (%@)";
"Review your list (%@) every week, this will keep it current and reliable." = "Tarkista luettelo viikoittain, pysyvät luotettavasti. (%@)";

/* %@ is where number of done actions will go */
"Happy" = "Iloinen";
"Confused" = "Sekoittaa";
"Unhappy" = "Onneton";
"Tell the story of your success and help others to achive the same!" = "Kerro tarina menestyksesi ja auttaa muita saavuttaa sama!";
"Search for help on a website or write an email to developer." = "Hae apua verkkosivuilla tai kirjoittaa sähköpostia kehittäjälle.";
"Sorry to hear. What can I do to fix this?" = "Pahoillani. Miten korjata tämä?";
"How do you feel about it?" = "Mitä mieltä olet siitä?";
"Congratulations! You completed %@ tasks." = "Onnittelut olet juuri valmistunut %@ tehtävää!";
"Please, rate this app on the App Store. Thanks!" = "Arvioi tämä app App Storesta.";
"Rate %@" = "Luokitus %@";
"Not now" = "Ei nyt";
"Don't ask again" = "Älä kysy uudelleen";
"I completed %@ tasks!" = "Olen valmis %@ tehtäviin!";

"Enjoying this app?" = "Nauttia tästä app?";
"Would you mind giving me some feedback?" = "Voisitko antaa meille palautetta?";
"How about rating on the App Store, then?" = "Entä luokitus App Storesta, sitten?";
"Not really" = "Ei";
"Yes!" = "Kyllä";
"No, thanks" = "Ei";
"Ok, sure" = "Kyllä";
"NO" = "Ei";
"YES" = "Kyllä";
